{
  "year": 2008,
  "coach": "Edgardo Bauza",
  "formation": "4-2-3-1",
  "players": [
    {
      "name": "José Francisco Cevallos",
      "position": "GK"
    },
    {
      "name": "Jhonny Cumbicus",
      "position": "RB"
    },
    {
      "name": "Alex Cedeño",
      "position": "CB"
    },
    {
      "name": "Jorge Cabrera",
      "position": "CB"
    },
    {
      "name": "Esteban Caicedo",
      "position": "LB"
    },
    {
      "name": "Patricio Urrutia",
      "position": "CDM"
    },
    {
      "name": "Édison Méndez",
      "position": "CM"
    },
    {
      "name": "Jefferson Montero",
      "position": "RW"
    },
    {
      "name": "Joffre Guerrón",
      "position": "CAM"
    },
    {
      "name": "Enrique Vera",
      "position": "LW"
    },
    {
      "name": "Luis Tejada",
      "position": "ST"
    },
    {
      "name": "Esteban Rojas",
      "position": "GK"
    },
    {
      "name": "Edison Alcivar",
      "position": "CB"
    },
    {
      "name": "Felipe Avenalde",
      "position": "CM"
    },
    {
      "name": "Christian Benítez",
      "position": "ST"
    },
    {
      "name": "Miguel Alba",
      "position": "CM"
    }
  ],
  "explanation": "This lineup is drawn from LDU Quito’s historic night in the 2008 Copa Libertadores final – one of the most significant matches in the club’s history. Under the guidance of coach Edgardo Bauza and in a 4-2-3-1 formation designed to balance a rock‐solid defence with a creative, dynamic attack, the team fielded a starting XI that combined experience and flair. José Francisco Cevallos anchored the defence, while the back‐line of Jhonny Cumbicus, Alex Cedeño, Jorge Cabrera and Esteban Caicedo ensured defensive stability. In midfield, Patricio Urrutia and Édison Méndez provided control and grit, allowing the attacking trio of Jefferson Montero, Joffre Guerrón and Enrique Vera to unlock opposing defences. Luis Tejada spearheaded the attack, delivering the cutting edge that ultimately led to LDU Quito’s first Copa Libertadores title. The selected substitutes – Esteban Rojas, Edison Alcivar, Felipe Avenalde, Christian Benítez and Miguel Alba – round out a matchday roster where all players shared the pitch in that defining final, symbolizing the club’s peak performance and historical significance on South America’s biggest stage."
}
