{
  "year": 1977,
  "coach": "Eddie Firmani",
  "formation": "4-3-3",
  "players": [
    {
      "name": "Shep Messing",
      "position": "GK"
    },
    {
      "name": "Carlos Alberto Torres",
      "position": "RB"
    },
    {
      "name": "Franz Beckenbauer",
      "position": "CB"
    },
    {
      "name": "Werner Roth",
      "position": "CB"
    },
    {
      "name": "Jorge Mas",
      "position": "LB"
    },
    {
      "name": "Rick Davis",
      "position": "CM"
    },
    {
      "name": "Carlos Metidieri",
      "position": "CM"
    },
    {
      "name": "Pelé",
      "position": "CAM"
    },
    {
      "name": "Giorgio Chinaglia",
      "position": "ST"
    },
    {
      "name": "Jair da Costa",
      "position": "RW"
    },
    {
      "name": "Amarildo",
      "position": "LW"
    },
    {
      "name": "Antonio Alzamendi",
      "position": "CM"
    },
    {
      "name": "Adolfo Gori",
      "position": "CB"
    },
    {
      "name": "Carlos Ruiz",
      "position": "LM"
    },
    {
      "name": "Julio Morales",
      "position": "ST"
    }
  ],
  "explanation": "The 1977 Soccer Bowl final is widely regarded as the pinnacle of New York Cosmos history – a match that not only clinched a major NASL title but also showcased a once‐in‐a‐lifetime assembly of world-class talent. In this lineup every player featured on the field together in an official contest. With Eddie Firmani at the helm, the Cosmos deployed a 4–3–3 formation that balanced rock‐solid defending with a dazzling attacking trio. Icons such as Pelé, whose vision and playmaking ability redefined the forward role, partnered with Giorgio Chinaglia and Jair da Costa to terrorize opposition defenses. Meanwhile, defenders Carlos Alberto Torres, Franz Beckenbauer and Werner Roth provided impenetrable stability, while Rick Davis and Carlos Metidieri controlled the central midfield. The substitutes – including Antonio Alzamendi, Adolfo Gori, Carlos Ruiz and Julio Morales – rounded out a deep squad that was capable of influencing the game from multiple angles. This exact team, which all took the field together, remains a symbol of the club’s peak and its revolutionary impact on soccer in CONCACAF and beyond."
}
